gw826943555/hal_gigadevice/include/dt-bindings/pinctrl/gd32f527r(m-s)xx-pinctrl.h
/*
 * Autogenerated file
 *
 * SPDX-License-Identifier: Apache 2.0
 */

#include "gd32-af.h"

/* ADC012_IN0 */
#define ADC012_IN0_PA0 \
	GD32_PINMUX_AF('A', 0, ANALOG)

/* ADC012_IN1 */
#define ADC012_IN1_PA1 \
	GD32_PINMUX_AF('A', 1, ANALOG)

/* ADC012_IN10 */
#define ADC012_IN10_PC0 \
	GD32_PINMUX_AF('C', 0, ANALOG)

/* ADC012_IN11 */
#define ADC012_IN11_PC1 \
	GD32_PINMUX_AF('C', 1, ANALOG)

/* ADC012_IN12 */
#define ADC012_IN12_PC2 \
	GD32_PINMUX_AF('C', 2, ANALOG)

/* ADC012_IN13 */
#define ADC012_IN13_PC3 \
	GD32_PINMUX_AF('C', 3, ANALOG)

/* ADC012_IN2 */
#define ADC012_IN2_PA2 \
	GD32_PINMUX_AF('A', 2, ANALOG)

/* ADC012_IN3 */
#define ADC012_IN3_PA3 \
	GD32_PINMUX_AF('A', 3, ANALOG)

/* ADC01_IN14 */
#define ADC01_IN14_PC4 \
	GD32_PINMUX_AF('C', 4, ANALOG)

/* ADC01_IN15 */
#define ADC01_IN15_PC5 \
	GD32_PINMUX_AF('C', 5, ANALOG)

/* ADC01_IN4 */
#define ADC01_IN4_PA4 \
	GD32_PINMUX_AF('A', 4, ANALOG)

/* ADC01_IN5 */
#define ADC01_IN5_PA5 \
	GD32_PINMUX_AF('A', 5, ANALOG)

/* ADC01_IN6 */
#define ADC01_IN6_PA6 \
	GD32_PINMUX_AF('A', 6, ANALOG)

/* ADC01_IN7 */
#define ADC01_IN7_PA7 \
	GD32_PINMUX_AF('A', 7, ANALOG)

/* ADC01_IN8 */
#define ADC01_IN8_PB0 \
	GD32_PINMUX_AF('B', 0, ANALOG)

/* ADC01_IN9 */
#define ADC01_IN9_PB1 \
	GD32_PINMUX_AF('B', 1, ANALOG)

/* ANALOG */
#define ANALOG_PA0 \
	GD32_PINMUX_AF('A', 0, ANALOG)
#define ANALOG_PA1 \
	GD32_PINMUX_AF('A', 1, ANALOG)
#define ANALOG_PA2 \
	GD32_PINMUX_AF('A', 2, ANALOG)
#define ANALOG_PA3 \
	GD32_PINMUX_AF('A', 3, ANALOG)
#define ANALOG_PA4 \
	GD32_PINMUX_AF('A', 4, ANALOG)
#define ANALOG_PA5 \
	GD32_PINMUX_AF('A', 5, ANALOG)
#define ANALOG_PA6 \
	GD32_PINMUX_AF('A', 6, ANALOG)
#define ANALOG_PA7 \
	GD32_PINMUX_AF('A', 7, ANALOG)
#define ANALOG_PA8 \
	GD32_PINMUX_AF('A', 8, ANALOG)
#define ANALOG_PA9 \
	GD32_PINMUX_AF('A', 9, ANALOG)
#define ANALOG_PA10 \
	GD32_PINMUX_AF('A', 10, ANALOG)
#define ANALOG_PA11 \
	GD32_PINMUX_AF('A', 11, ANALOG)
#define ANALOG_PA12 \
	GD32_PINMUX_AF('A', 12, ANALOG)
#define ANALOG_PA13 \
	GD32_PINMUX_AF('A', 13, ANALOG)
#define ANALOG_PA14 \
	GD32_PINMUX_AF('A', 14, ANALOG)
#define ANALOG_PA15 \
	GD32_PINMUX_AF('A', 15, ANALOG)
#define ANALOG_PB0 \
	GD32_PINMUX_AF('B', 0, ANALOG)
#define ANALOG_PB1 \
	GD32_PINMUX_AF('B', 1, ANALOG)
#define ANALOG_PB2 \
	GD32_PINMUX_AF('B', 2, ANALOG)
#define ANALOG_PB3 \
	GD32_PINMUX_AF('B', 3, ANALOG)
#define ANALOG_PB4 \
	GD32_PINMUX_AF('B', 4, ANALOG)
#define ANALOG_PB5 \
	GD32_PINMUX_AF('B', 5, ANALOG)
#define ANALOG_PB6 \
	GD32_PINMUX_AF('B', 6, ANALOG)
#define ANALOG_PB7 \
	GD32_PINMUX_AF('B', 7, ANALOG)
#define ANALOG_PB8 \
	GD32_PINMUX_AF('B', 8, ANALOG)
#define ANALOG_PB9 \
	GD32_PINMUX_AF('B', 9, ANALOG)
#define ANALOG_PB10 \
	GD32_PINMUX_AF('B', 10, ANALOG)
#define ANALOG_PB11 \
	GD32_PINMUX_AF('B', 11, ANALOG)
#define ANALOG_PB12 \
	GD32_PINMUX_AF('B', 12, ANALOG)
#define ANALOG_PB13 \
	GD32_PINMUX_AF('B', 13, ANALOG)
#define ANALOG_PB14 \
	GD32_PINMUX_AF('B', 14, ANALOG)
#define ANALOG_PB15 \
	GD32_PINMUX_AF('B', 15, ANALOG)
#define ANALOG_PC0 \
	GD32_PINMUX_AF('C', 0, ANALOG)
#define ANALOG_PC1 \
	GD32_PINMUX_AF('C', 1, ANALOG)
#define ANALOG_PC2 \
	GD32_PINMUX_AF('C', 2, ANALOG)
#define ANALOG_PC3 \
	GD32_PINMUX_AF('C', 3, ANALOG)
#define ANALOG_PC4 \
	GD32_PINMUX_AF('C', 4, ANALOG)
#define ANALOG_PC5 \
	GD32_PINMUX_AF('C', 5, ANALOG)
#define ANALOG_PC6 \
	GD32_PINMUX_AF('C', 6, ANALOG)
#define ANALOG_PC7 \
	GD32_PINMUX_AF('C', 7, ANALOG)
#define ANALOG_PC8 \
	GD32_PINMUX_AF('C', 8, ANALOG)
#define ANALOG_PC9 \
	GD32_PINMUX_AF('C', 9, ANALOG)
#define ANALOG_PC10 \
	GD32_PINMUX_AF('C', 10, ANALOG)
#define ANALOG_PC11 \
	GD32_PINMUX_AF('C', 11, ANALOG)
#define ANALOG_PC12 \
	GD32_PINMUX_AF('C', 12, ANALOG)
#define ANALOG_PC13 \
	GD32_PINMUX_AF('C', 13, ANALOG)
#define ANALOG_PC14 \
	GD32_PINMUX_AF('C', 14, ANALOG)
#define ANALOG_PC15 \
	GD32_PINMUX_AF('C', 15, ANALOG)

/* CAN0_RX */
#define CAN0_RX_PA11 \
	GD32_PINMUX_AF('A', 11, AF9)
#define CAN0_RX_PB8 \
	GD32_PINMUX_AF('B', 8, AF9)

/* CAN0_TX */
#define CAN0_TX_PA12 \
	GD32_PINMUX_AF('A', 12, AF9)
#define CAN0_TX_PB9 \
	GD32_PINMUX_AF('B', 9, AF9)

/* CAN1_RX */
#define CAN1_RX_PB5 \
	GD32_PINMUX_AF('B', 5, AF9)
#define CAN1_RX_PB12 \
	GD32_PINMUX_AF('B', 12, AF9)

/* CAN1_TX */
#define CAN1_TX_PB6 \
	GD32_PINMUX_AF('B', 6, AF9)
#define CAN1_TX_PB13 \
	GD32_PINMUX_AF('B', 13, AF9)

/* CK_OUT0 */
#define CK_OUT0_PA8 \
	GD32_PINMUX_AF('A', 8, AF0)

/* CK_OUT1 */
#define CK_OUT1_PC9 \
	GD32_PINMUX_AF('C', 9, AF0)

/* CTC_SYNC */
#define CTC_SYNC_PA8 \
	GD32_PINMUX_AF('A', 8, AF9)

/* DAC0_OUT0 */
#define DAC0_OUT0_PA4 \
	GD32_PINMUX_AF('A', 4, ANALOG)

/* DAC0_OUT1 */
#define DAC0_OUT1_PA5 \
	GD32_PINMUX_AF('A', 5, ANALOG)

/* DCI_D0 */
#define DCI_D0_PA9 \
	GD32_PINMUX_AF('A', 9, AF13)
#define DCI_D0_PC6 \
	GD32_PINMUX_AF('C', 6, AF13)

/* DCI_D1 */
#define DCI_D1_PA10 \
	GD32_PINMUX_AF('A', 10, AF13)
#define DCI_D1_PC7 \
	GD32_PINMUX_AF('C', 7, AF13)

/* DCI_D10 */
#define DCI_D10_PB5 \
	GD32_PINMUX_AF('B', 5, AF13)

/* DCI_D2 */
#define DCI_D2_PC8 \
	GD32_PINMUX_AF('C', 8, AF13)

/* DCI_D3 */
#define DCI_D3_PC9 \
	GD32_PINMUX_AF('C', 9, AF13)

/* DCI_D4 */
#define DCI_D4_PC11 \
	GD32_PINMUX_AF('C', 11, AF13)

/* DCI_D5 */
#define DCI_D5_PB6 \
	GD32_PINMUX_AF('B', 6, AF13)

/* DCI_D6 */
#define DCI_D6_PB8 \
	GD32_PINMUX_AF('B', 8, AF13)

/* DCI_D7 */
#define DCI_D7_PB9 \
	GD32_PINMUX_AF('B', 9, AF13)

/* DCI_D8 */
#define DCI_D8_PC10 \
	GD32_PINMUX_AF('C', 10, AF13)

/* DCI_D9 */
#define DCI_D9_PC12 \
	GD32_PINMUX_AF('C', 12, AF13)

/* DCI_HSYNC */
#define DCI_HSYNC_PA4 \
	GD32_PINMUX_AF('A', 4, AF13)

/* DCI_PIXCLK */
#define DCI_PIXCLK_PA6 \
	GD32_PINMUX_AF('A', 6, AF13)

/* DCI_VSYNC */
#define DCI_VSYNC_PB7 \
	GD32_PINMUX_AF('B', 7, AF13)

/* ETH_MDC */
#define ETH_MDC_PC1 \
	GD32_PINMUX_AF('C', 1, AF11)

/* ETH_MDIO */
#define ETH_MDIO_PA2 \
	GD32_PINMUX_AF('A', 2, AF11)

/* ETH_MII_COL */
#define ETH_MII_COL_PA3 \
	GD32_PINMUX_AF('A', 3, AF11)

/* ETH_MII_CRS */
#define ETH_MII_CRS_PA0 \
	GD32_PINMUX_AF('A', 0, AF11)

/* ETH_MII_RXD0 */
#define ETH_MII_RXD0_PC4 \
	GD32_PINMUX_AF('C', 4, AF11)

