gw826943555/hal_gigadevice/include/dt-bindings/pinctrl/gd32f527r(m-s)xx-pinctrl.h
/* I2S2_WS */
#define I2S2_WS_PA4 \
	GD32_PINMUX_AF('A', 4, AF6)
#define I2S2_WS_PA15 \
	GD32_PINMUX_AF('A', 15, AF6)

/* I2S_CKIN */
#define I2S_CKIN_PA2 \
	GD32_PINMUX_AF('A', 2, AF5)
#define I2S_CKIN_PB11 \
	GD32_PINMUX_AF('B', 11, AF5)
#define I2S_CKIN_PC9 \
	GD32_PINMUX_AF('C', 9, AF5)

/* IREF */
#define IREF_PB0 \
	GD32_PINMUX_AF('B', 0, ANALOG)

/* JNTRST */
#define JNTRST_PB4 \
	GD32_PINMUX_AF('B', 4, AF0)

/* JTCK */
#define JTCK_PA14 \
	GD32_PINMUX_AF('A', 14, AF0)

/* JTDI */
#define JTDI_PA15 \
	GD32_PINMUX_AF('A', 15, AF0)

/* JTDO */
#define JTDO_PB3 \
	GD32_PINMUX_AF('B', 3, AF0)

/* JTMS */
#define JTMS_PA13 \
	GD32_PINMUX_AF('A', 13, AF0)

/* RTC_REFIN */
#define RTC_REFIN_PB15 \
	GD32_PINMUX_AF('B', 15, AF0)

/* SAI0_FS_0 */
#define SAI0_FS_0_PA3 \
	GD32_PINMUX_AF('A', 3, AF6)

/* SAI0_FS_1 */
#define SAI0_FS_1_PB9 \
	GD32_PINMUX_AF('B', 9, AF6)

/* SAI0_MCLK_1 */
#define SAI0_MCLK_1_PC0 \
	GD32_PINMUX_AF('C', 0, AF6)

/* SAI0_SD_0 */
#define SAI0_SD_0_PB2 \
	GD32_PINMUX_AF('B', 2, AF6)
#define SAI0_SD_0_PC1 \
	GD32_PINMUX_AF('C', 1, AF6)

/* SAI0_SD_1 */
#define SAI0_SD_1_PA9 \
	GD32_PINMUX_AF('A', 9, AF6)

/* SDIO_CK */
#define SDIO_CK_PB2 \
	GD32_PINMUX_AF('B', 2, AF12)
#define SDIO_CK_PC12 \
	GD32_PINMUX_AF('C', 12, AF12)

/* SDIO_CMD */
#define SDIO_CMD_PA6 \
	GD32_PINMUX_AF('A', 6, AF12)

/* SDIO_D0 */
#define SDIO_D0_PB4 \
	GD32_PINMUX_AF('B', 4, AF12)
#define SDIO_D0_PC8 \
	GD32_PINMUX_AF('C', 8, AF12)

/* SDIO_D1 */
#define SDIO_D1_PA8 \
	GD32_PINMUX_AF('A', 8, AF12)
#define SDIO_D1_PB0 \
	GD32_PINMUX_AF('B', 0, AF12)
#define SDIO_D1_PC9 \
	GD32_PINMUX_AF('C', 9, AF12)

/* SDIO_D2 */
#define SDIO_D2_PA9 \
	GD32_PINMUX_AF('A', 9, AF12)
#define SDIO_D2_PB1 \
	GD32_PINMUX_AF('B', 1, AF12)
#define SDIO_D2_PC10 \
	GD32_PINMUX_AF('C', 10, AF12)

/* SDIO_D3 */
#define SDIO_D3_PC11 \
	GD32_PINMUX_AF('C', 11, AF12)

/* SDIO_D4 */
#define SDIO_D4_PB8 \
	GD32_PINMUX_AF('B', 8, AF12)

/* SDIO_D5 */
#define SDIO_D5_PB9 \
	GD32_PINMUX_AF('B', 9, AF12)

/* SDIO_D6 */
#define SDIO_D6_PC6 \
	GD32_PINMUX_AF('C', 6, AF12)

/* SDIO_D7 */
#define SDIO_D7_PB10 \
	GD32_PINMUX_AF('B', 10, AF12)
#define SDIO_D7_PC7 \
	GD32_PINMUX_AF('C', 7, AF12)

/* SPI0_MISO */
#define SPI0_MISO_PA6 \
	GD32_PINMUX_AF('A', 6, AF5)
#define SPI0_MISO_PB4 \
	GD32_PINMUX_AF('B', 4, AF5)

/* SPI0_MOSI */
#define SPI0_MOSI_PA7 \
	GD32_PINMUX_AF('A', 7, AF5)
#define SPI0_MOSI_PB5 \
	GD32_PINMUX_AF('B', 5, AF5)

/* SPI0_NSS */
#define SPI0_NSS_PA4 \
	GD32_PINMUX_AF('A', 4, AF5)
#define SPI0_NSS_PA15 \
	GD32_PINMUX_AF('A', 15, AF5)
#define SPI0_NSS_PB5 \
	GD32_PINMUX_AF('B', 5, AF7)

/* SPI0_SCK */
#define SPI0_SCK_PA5 \
	GD32_PINMUX_AF('A', 5, AF5)
#define SPI0_SCK_PB3 \
	GD32_PINMUX_AF('B', 3, AF5)
#define SPI0_SCK_PC13 \
	GD32_PINMUX_AF('C', 13, AF5)

/* SPI1_MISO */
#define SPI1_MISO_PB14 \
	GD32_PINMUX_AF('B', 14, AF5)
#define SPI1_MISO_PC2 \
	GD32_PINMUX_AF('C', 2, AF5)

/* SPI1_MOSI */
#define SPI1_MOSI_PB15 \
	GD32_PINMUX_AF('B', 15, AF5)
#define SPI1_MOSI_PC1 \
	GD32_PINMUX_AF('C', 1, AF7)
#define SPI1_MOSI_PC3 \
	GD32_PINMUX_AF('C', 3, AF5)

/* SPI1_NSS */
#define SPI1_NSS_PB9 \
	GD32_PINMUX_AF('B', 9, AF5)
#define SPI1_NSS_PB12 \
	GD32_PINMUX_AF('B', 12, AF5)

/* SPI1_SCK */
#define SPI1_SCK_PA9 \
	GD32_PINMUX_AF('A', 9, AF5)
#define SPI1_SCK_PB10 \
	GD32_PINMUX_AF('B', 10, AF5)
#define SPI1_SCK_PB13 \
	GD32_PINMUX_AF('B', 13, AF5)
#define SPI1_SCK_PC7 \
	GD32_PINMUX_AF('C', 7, AF5)

/* SPI2_MISO */
#define SPI2_MISO_PB4 \
	GD32_PINMUX_AF('B', 4, AF6)
#define SPI2_MISO_PC11 \
	GD32_PINMUX_AF('C', 11, AF6)

/* SPI2_MOSI */
#define SPI2_MOSI_PB0 \
	GD32_PINMUX_AF('B', 0, AF7)
#define SPI2_MOSI_PB2 \
	GD32_PINMUX_AF('B', 2, AF7)
#define SPI2_MOSI_PB5 \
	GD32_PINMUX_AF('B', 5, AF6)
#define SPI2_MOSI_PC1 \
	GD32_PINMUX_AF('C', 1, AF5)
#define SPI2_MOSI_PC12 \
	GD32_PINMUX_AF('C', 12, AF6)

/* SPI2_NSS */
#define SPI2_NSS_PA4 \
	GD32_PINMUX_AF('A', 4, AF6)
#define SPI2_NSS_PA15 \
	GD32_PINMUX_AF('A', 15, AF6)

/* SPI2_SCK */
#define SPI2_SCK_PB3 \
	GD32_PINMUX_AF('B', 3, AF6)
#define SPI2_SCK_PC10 \
	GD32_PINMUX_AF('C', 10, AF6)

/* SPI3_MISO */
#define SPI3_MISO_PA11 \
	GD32_PINMUX_AF('A', 11, AF6)

/* SPI3_MOSI */
#define SPI3_MOSI_PA1 \
	GD32_PINMUX_AF('A', 1, AF5)

/* SPI3_NSS */
#define SPI3_NSS_PB12 \
	GD32_PINMUX_AF('B', 12, AF6)

/* SPI3_SCK */
#define SPI3_SCK_PB13 \
	GD32_PINMUX_AF('B', 13, AF6)

/* SPI4_MISO */
#define SPI4_MISO_PA12 \
	GD32_PINMUX_AF('A', 12, AF6)

/* SPI4_MOSI */
#define SPI4_MOSI_PA10 \
	GD32_PINMUX_AF('A', 10, AF6)
#define SPI4_MOSI_PB8 \
	GD32_PINMUX_AF('B', 8, AF6)

/* SPI4_NSS */
#define SPI4_NSS_PA6 \
	GD32_PINMUX_AF('A', 6, AF4)
#define SPI4_NSS_PB1 \
	GD32_PINMUX_AF('B', 1, AF6)

/* SPI4_SCK */
#define SPI4_SCK_PB0 \
	GD32_PINMUX_AF('B', 0, AF6)

/* SPI5_MISO */
#define SPI5_MISO_PB12 \
	GD32_PINMUX_AF('B', 12, AF13)

/* SPI5_MOSI */
#define SPI5_MOSI_PB6 \
	GD32_PINMUX_AF('B', 6, AF6)

/* SPI5_NSS */
#define SPI5_NSS_PB8 \
	GD32_PINMUX_AF('B', 8, AF5)

/* SWCLK */
#define SWCLK_PA14 \
	GD32_PINMUX_AF('A', 14, AF0)

/* SWDIO */
#define SWDIO_PA13 \
	GD32_PINMUX_AF('A', 13, AF0)

/* TIMER0_BRKIN */
#define TIMER0_BRKIN_PA6 \
	GD32_PINMUX_AF('A', 6, AF1)
#define TIMER0_BRKIN_PB12 \
	GD32_PINMUX_AF('B', 12, AF1)

/* TIMER0_CH0 */
#define TIMER0_CH0_PA8 \
	GD32_PINMUX_AF('A', 8, AF1)

/* TIMER0_CH0_ON */
#define TIMER0_CH0_ON_PA7 \
	GD32_PINMUX_AF('A', 7, AF1)
#define TIMER0_CH0_ON_PB13 \
	GD32_PINMUX_AF('B', 13, AF1)

/* TIMER0_CH1 */
#define TIMER0_CH1_PA9 \
	GD32_PINMUX_AF('A', 9, AF1)

/* TIMER0_CH1_ON */
#define TIMER0_CH1_ON_PB0 \
	GD32_PINMUX_AF('B', 0, AF1)
#define TIMER0_CH1_ON_PB1 \
	GD32_PINMUX_AF('B', 1, AF1)
#define TIMER0_CH1_ON_PB14 \
	GD32_PINMUX_AF('B', 14, AF1)
#define TIMER0_CH1_ON_PC9 \
	GD32_PINMUX_AF('C', 9, AF1)

/* TIMER0_CH2 */
#define TIMER0_CH2_PA10 \
	GD32_PINMUX_AF('A', 10, AF1)
#define TIMER0_CH2_PB1 \
	GD32_PINMUX_AF('B', 1, AF4)

/* TIMER0_CH2_ON */
#define TIMER0_CH2_ON_PB15 \
	GD32_PINMUX_AF('B', 15, AF1)

/* TIMER0_CH3 */
#define TIMER0_CH3_PA11 \
	GD32_PINMUX_AF('A', 11, AF1)

/* TIMER0_ETI */
#define TIMER0_ETI_PA12 \
	GD32_PINMUX_AF('A', 12, AF1)

/* TIMER10_CH0 */
#define TIMER10_CH0_PB9 \
	GD32_PINMUX_AF('B', 9, AF3)

