gw826943555/hal_gigadevice/include/dt-bindings/pinctrl/gd32f527r(m-s)xx-pinctrl.h
/* TIMER11_CH0 */
#define TIMER11_CH0_PB14 \
	GD32_PINMUX_AF('B', 14, AF9)

/* TIMER11_CH1 */
#define TIMER11_CH1_PB15 \
	GD32_PINMUX_AF('B', 15, AF9)

/* TIMER12_CH0 */
#define TIMER12_CH0_PA6 \
	GD32_PINMUX_AF('A', 6, AF9)

/* TIMER13_CH0 */
#define TIMER13_CH0_PA7 \
	GD32_PINMUX_AF('A', 7, AF9)

/* TIMER1_CH0 */
#define TIMER1_CH0_PA0 \
	GD32_PINMUX_AF('A', 0, AF1)
#define TIMER1_CH0_PA5 \
	GD32_PINMUX_AF('A', 5, AF1)
#define TIMER1_CH0_PA15 \
	GD32_PINMUX_AF('A', 15, AF1)
#define TIMER1_CH0_PB8 \
	GD32_PINMUX_AF('B', 8, AF1)

/* TIMER1_CH1 */
#define TIMER1_CH1_PA1 \
	GD32_PINMUX_AF('A', 1, AF1)
#define TIMER1_CH1_PB3 \
	GD32_PINMUX_AF('B', 3, AF1)
#define TIMER1_CH1_PB9 \
	GD32_PINMUX_AF('B', 9, AF1)

/* TIMER1_CH2 */
#define TIMER1_CH2_PA2 \
	GD32_PINMUX_AF('A', 2, AF1)
#define TIMER1_CH2_PB10 \
	GD32_PINMUX_AF('B', 10, AF1)

/* TIMER1_CH3 */
#define TIMER1_CH3_PA3 \
	GD32_PINMUX_AF('A', 3, AF1)
#define TIMER1_CH3_PB2 \
	GD32_PINMUX_AF('B', 2, AF1)
#define TIMER1_CH3_PB11 \
	GD32_PINMUX_AF('B', 11, AF1)

/* TIMER1_ETI */
#define TIMER1_ETI_PA0 \
	GD32_PINMUX_AF('A', 0, AF1)
#define TIMER1_ETI_PA5 \
	GD32_PINMUX_AF('A', 5, AF1)
#define TIMER1_ETI_PA15 \
	GD32_PINMUX_AF('A', 15, AF1)
#define TIMER1_ETI_PB8 \
	GD32_PINMUX_AF('B', 8, AF1)

/* TIMER2_CH0 */
#define TIMER2_CH0_PA6 \
	GD32_PINMUX_AF('A', 6, AF2)
#define TIMER2_CH0_PB4 \
	GD32_PINMUX_AF('B', 4, AF2)
#define TIMER2_CH0_PC6 \
	GD32_PINMUX_AF('C', 6, AF2)

/* TIMER2_CH1 */
#define TIMER2_CH1_PA7 \
	GD32_PINMUX_AF('A', 7, AF2)
#define TIMER2_CH1_PB5 \
	GD32_PINMUX_AF('B', 5, AF2)
#define TIMER2_CH1_PC7 \
	GD32_PINMUX_AF('C', 7, AF2)

/* TIMER2_CH2 */
#define TIMER2_CH2_PB0 \
	GD32_PINMUX_AF('B', 0, AF2)
#define TIMER2_CH2_PC8 \
	GD32_PINMUX_AF('C', 8, AF2)

/* TIMER2_CH3 */
#define TIMER2_CH3_PB1 \
	GD32_PINMUX_AF('B', 1, AF2)
#define TIMER2_CH3_PC9 \
	GD32_PINMUX_AF('C', 9, AF2)

/* TIMER3_CH0 */
#define TIMER3_CH0_PB6 \
	GD32_PINMUX_AF('B', 6, AF2)

/* TIMER3_CH1 */
#define TIMER3_CH1_PB7 \
	GD32_PINMUX_AF('B', 7, AF2)

/* TIMER3_CH2 */
#define TIMER3_CH2_PB8 \
	GD32_PINMUX_AF('B', 8, AF2)

/* TIMER3_CH3 */
#define TIMER3_CH3_PB9 \
	GD32_PINMUX_AF('B', 9, AF2)

/* TIMER4_CH0 */
#define TIMER4_CH0_PA0 \
	GD32_PINMUX_AF('A', 0, AF2)

/* TIMER4_CH1 */
#define TIMER4_CH1_PA1 \
	GD32_PINMUX_AF('A', 1, AF2)

/* TIMER4_CH2 */
#define TIMER4_CH2_PA2 \
	GD32_PINMUX_AF('A', 2, AF2)

/* TIMER4_CH3 */
#define TIMER4_CH3_PA3 \
	GD32_PINMUX_AF('A', 3, AF2)

/* TIMER7_BRKIN */
#define TIMER7_BRKIN_PA6 \
	GD32_PINMUX_AF('A', 6, AF3)

/* TIMER7_CH0 */
#define TIMER7_CH0_PB4 \
	GD32_PINMUX_AF('B', 4, AF3)
#define TIMER7_CH0_PC6 \
	GD32_PINMUX_AF('C', 6, AF3)

/* TIMER7_CH0_ON */
#define TIMER7_CH0_ON_PA5 \
	GD32_PINMUX_AF('A', 5, AF3)
#define TIMER7_CH0_ON_PA7 \
	GD32_PINMUX_AF('A', 7, AF3)
#define TIMER7_CH0_ON_PC6 \
	GD32_PINMUX_AF('C', 6, AF1)

/* TIMER7_CH1 */
#define TIMER7_CH1_PC7 \
	GD32_PINMUX_AF('C', 7, AF3)

/* TIMER7_CH1_ON */
#define TIMER7_CH1_ON_PA4 \
	GD32_PINMUX_AF('A', 4, AF3)
#define TIMER7_CH1_ON_PB0 \
	GD32_PINMUX_AF('B', 0, AF3)
#define TIMER7_CH1_ON_PB14 \
	GD32_PINMUX_AF('B', 14, AF3)

/* TIMER7_CH2 */
#define TIMER7_CH2_PC8 \
	GD32_PINMUX_AF('C', 8, AF3)

/* TIMER7_CH2_ON */
#define TIMER7_CH2_ON_PB1 \
	GD32_PINMUX_AF('B', 1, AF3)
#define TIMER7_CH2_ON_PB15 \
	GD32_PINMUX_AF('B', 15, AF3)
#define TIMER7_CH2_ON_PC0 \
	GD32_PINMUX_AF('C', 0, AF3)

/* TIMER7_CH3 */
#define TIMER7_CH3_PC9 \
	GD32_PINMUX_AF('C', 9, AF3)

/* TIMER7_ETI */
#define TIMER7_ETI_PA0 \
	GD32_PINMUX_AF('A', 0, AF3)

/* TIMER8_CH0 */
#define TIMER8_CH0_PA2 \
	GD32_PINMUX_AF('A', 2, AF3)

/* TIMER8_CH1 */
#define TIMER8_CH1_PA3 \
	GD32_PINMUX_AF('A', 3, AF3)

/* TIMER9_CH0 */
#define TIMER9_CH0_PB8 \
	GD32_PINMUX_AF('B', 8, AF3)

/* TLI_B5 */
#define TLI_B5_PA3 \
	GD32_PINMUX_AF('A', 3, AF14)

/* TLI_B6 */
#define TLI_B6_PB8 \
	GD32_PINMUX_AF('B', 8, AF14)

/* TLI_B7 */
#define TLI_B7_PB9 \
	GD32_PINMUX_AF('B', 9, AF14)

/* TLI_G2 */
#define TLI_G2_PA6 \
	GD32_PINMUX_AF('A', 6, AF14)

/* TLI_G4 */
#define TLI_G4_PB10 \
	GD32_PINMUX_AF('B', 10, AF14)

/* TLI_G5 */
#define TLI_G5_PB11 \
	GD32_PINMUX_AF('B', 11, AF14)

/* TLI_G6 */
#define TLI_G6_PC7 \
	GD32_PINMUX_AF('C', 7, AF14)

/* TLI_HSYNC */
#define TLI_HSYNC_PC6 \
	GD32_PINMUX_AF('C', 6, AF14)

/* TLI_R2 */
#define TLI_R2_PC10 \
	GD32_PINMUX_AF('C', 10, AF14)

/* TLI_R3 */
#define TLI_R3_PB0 \
	GD32_PINMUX_AF('B', 0, AF9)

/* TLI_R4 */
#define TLI_R4_PA11 \
	GD32_PINMUX_AF('A', 11, AF14)

/* TLI_R5 */
#define TLI_R5_PA12 \
	GD32_PINMUX_AF('A', 12, AF14)

/* TLI_R6 */
#define TLI_R6_PA8 \
	GD32_PINMUX_AF('A', 8, AF14)
#define TLI_R6_PB1 \
	GD32_PINMUX_AF('B', 1, AF9)

/* TLI_VSYNC */
#define TLI_VSYNC_PA4 \
	GD32_PINMUX_AF('A', 4, AF14)

/* TRACED0 */
#define TRACED0_PC8 \
	GD32_PINMUX_AF('C', 8, AF0)

/* TRACESWO */
#define TRACESWO_PB3 \
	GD32_PINMUX_AF('B', 3, AF0)

/* UART3_RX */
#define UART3_RX_PA1 \
	GD32_PINMUX_AF('A', 1, AF8)
#define UART3_RX_PC11 \
	GD32_PINMUX_AF('C', 11, AF8)

/* UART3_TX */
#define UART3_TX_PA0 \
	GD32_PINMUX_AF('A', 0, AF8)
#define UART3_TX_PC10 \
	GD32_PINMUX_AF('C', 10, AF8)

/* UART4_TX */
#define UART4_TX_PC12 \
	GD32_PINMUX_AF('C', 12, AF8)

/* USART0_CK */
#define USART0_CK_PA8 \
	GD32_PINMUX_AF('A', 8, AF7)

/* USART0_CTS */
#define USART0_CTS_PA11 \
	GD32_PINMUX_AF('A', 11, AF7)

/* USART0_RTS */
#define USART0_RTS_PA12 \
	GD32_PINMUX_AF('A', 12, AF7)

/* USART0_RX */
#define USART0_RX_PA10 \
	GD32_PINMUX_AF('A', 10, AF7)
#define USART0_RX_PB3 \
	GD32_PINMUX_AF('B', 3, AF7)
#define USART0_RX_PB7 \
	GD32_PINMUX_AF('B', 7, AF7)

/* USART0_TX */
#define USART0_TX_PA9 \
	GD32_PINMUX_AF('A', 9, AF7)
#define USART0_TX_PA15 \
	GD32_PINMUX_AF('A', 15, AF7)
#define USART0_TX_PB6 \
	GD32_PINMUX_AF('B', 6, AF7)

/* USART1_CK */
#define USART1_CK_PA4 \
	GD32_PINMUX_AF('A', 4, AF7)

/* USART1_CTS */
#define USART1_CTS_PA0 \
	GD32_PINMUX_AF('A', 0, AF7)

/* USART1_RTS */
#define USART1_RTS_PA1 \
	GD32_PINMUX_AF('A', 1, AF7)

/* USART1_RX */
#define USART1_RX_PA3 \
	GD32_PINMUX_AF('A', 3, AF7)

/* USART1_TX */
#define USART1_TX_PA2 \
	GD32_PINMUX_AF('A', 2, AF7)

